{
    "sholawat_nabi": [
      {
        "name": "Sholawat Al-Fatih",
        "arabic": "اللَّهُمَّ صَلَّ وَسَلِّمُ وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدِ الْفَاتِحِ لِمَا أُغْلِقَ وَالْخَاتِمِ لِمَا سَبَقَ وَالنَّاصِرِ الْحَقِّ بِالْحَقِّ وَالْهَادِى إِلَى صِرَاطِكَ الْمُسْتَقِيمِ صَلَّى اللهُ عَلَيْهِ وَعَلَى الِهِ وَأَصْحَابِهِ حَقَّ قَدْرِهِ وَمِقْدَارِهِ الْعَظِيْمِ",
        "arabic_latin": "Allahumma shalli wa sallim wa bârik 'alâ sayyidinâ Muhammadinil fâtihi limâ ughliqa, wal khâtimi limâ sabaqa wan nâshiril haqqa bilhaqqi, wal hâdî ilâ shirâthikal mustaqîmi, shallâllâhu 'alaihi wa 'alâ âlihi wa ash hâbihi haqqa qadrihi wa miqdârihil 'adzîmi",
        "translation": "Ya Allah, curahkanlah rahmat takzim, salam sejahtera serta keberkahan kepada junjungan kami, Nabi Muhammad, sebagai pembuka sesuatu yang terkunci (tertutup) dan penutup sesuatu (para utusan) yang terdahulu. Dialah penolong kebenaran dengan kebenaran dan pemberi petunjuk menuju jalan-Mu yang lurus. Semoga Allah melimpahkan (memberikan) sholawat kepada Nabi Muhammad, keluarganya, dan para sahabatnya dengan kekuasaan dan ukuran Allah Yang Mahaagung."
      },
      {
        "name": "Sholawat Syifa' (Obat)",
        "arabic": "اللهُمَّ صَلَّ عَلَى سَيِّدِنَا مُحَمَّدٍ طِبّ الْقُلُوْبِ وَدَوَابِهَا وَعَافِيَةِ الْأَبْدَانِ وَشِفَابِهَا وَنُوْرِ الأَبْصَارِ وَضِيَابِهَا وَعَلَى الِهِ وَصَحْبِهِ وَبَارِكْ وَسَلَّمْ",
        "arabic_latin": "Allâhumma shalli alâ Sayyidinâ Muhammadin thibbil qulûbi wa dawâ-ihâ wa 'âfiyatil abdâni wa syifâ-ihâ wa nûril abshâri wa dhiyâ-ihâ wa 'alâ âlihi wa shahbihi wa bârik wa sallim.",
        "translation": "Ya Allah, limpahkanlah shawalat dan salam kepada junjungan kami, Nabi Muhammad, sebagai dokter hati dan menjadi obatnya. Obat untuk badan dan penyembuhnya, cahaya segala penglihatan dan menjadi sinarnya. Semoga keberkahan dan keselamatan dicurahkan pada keluarga dan sahabat-sahabatnya"
      },
      {
        "name": "Sholawat Khawwâsh",
        "arabic": "صَلَّى اللهُ عَلَى مُحَمَّدِ",
        "arabic_latin": "Shallallahu 'alâ Muhammadin",
        "translation": "Semoga Allah memberikan rahmat-Nya kepada Nabi Muhammad"
      },
      {
        "name": "Sholawat Ta'dzhimul Qiyam",
        "arabic": "اللَّهُمَّ صَلَّ عَلَى مُحَمَّدٍ وَعَلَى أَلِهِ وَسَلَّمْ",
        "arabic_latin": "Allâhumma shalli alâ Muhammadin wa 'alâ âlihi wa sallim",
        "translation": "Ya Allah limpahkanlah kesejahteraan dan keselamatan atas Nabi Muhammad dan keluarganya"
      },
      {
        "name": "Sholawat Adrikiyah/Mukhathab",
        "arabic": "الصَّلَاةُ وَالسَّلَامُ عَلَيْكَ يَا سَيِّدِى قَلَّتْ حِيْلَتِي يَا رَسُولَ اللهِ خُذْ بِيَدِى أَدْرِكْنى",
        "arabic_latin": "Ashshalâtu was-salâmu 'alaika yâ Sayyidî yâ Rasûlallâhi khudz biyadî qallat hîlatî adriknî",
        "translation": "Rahmat dan keselamatan semoga tetap atas engkau wahai penghulu kami ya Rasulullah, peganglah tanganku, habis daya upayaku, semoga engkau berkenan menolong aku."
      },
      {
        "name": "Sholawat Nariyah",
        "arabic": "اللهُمَّ صَلِّ صَلَاةً كَامِلَةً وَسَلَّمْ سَلَامًا تَامَّا عَلَى سَيّدِنَا مُحَمَّدٍ الَّذِي تَنْحَلُ بِهِ الْعُقَدُ وَتَنْفَرِجُ بِهِ الْكُرَبُ وَتُقْضَى بِهِ الْحَوَايِجُ وَتُنَالُ بِهِ الرَّغَابِبُ وَحُسْنُ الْخَوَاتِمِ وَيُسْتَسْقَى الْغَمَامُ بِوَجْهِهِ الْكَرِيمِ وَعَلَى الِهِ وَصَحْبِهِ فِي كُلِّ لَمْحَةٍ وَنَفَسٍ بِعَدَدِ كُلِّ مَعْلُوْمٍ لَّكَ",
        "arabic_latin": "Allahumma shalli shalâtan kâmilatan wa sallim salâman tâmman 'alâ sayyidinaa Muhammad alladzî tanhallu bihil 'uqadu wa tanfariju bihil kurabu wa tuqdhâ bihil hawaaiju wa tunâlu bihir raghâ-ibu wa husnul khawaatimi wa yustasqal ghamâmu biwajhihil karîmi wa 'alâ âlihi wa shahbihî fi kulli lamhatin wa nafasin bi-'adadi kulli ma'lûmil laka",
        "translation": "Ya Allah, limpahkanlah rahmat dan keselamatan yang sempurna kepada junjungan kami Nabi Muhammad yang dapat melepas beberapa kerepotan/ikatan, menghilangkan beberapa kesusahan, mendatangkan beberapa hajat, khusnul khatimah, dan curahan rahmat sebab wajah mulia pada tiap saat dan nafas sebanyak yang Engkau ketahui, dengan kerahmatan-Mu Dzat Yang paling Belas Kasih"
      },
      {
        "name": "Sholawat Munjiyat",
        "arabic": "اللهُمَّ صَلَّ عَلَى سَيِّدِنَا مُحَمَّدٍ صَلَاةٌ تُنْجِيْنَا بِهَا مِنْ جَمِيعِ الْأَهْوَالِ وَالْأَفَاتِ وَتَقْضِي لَنَا بِهَا جَمِيعَ الْحَاجَاتِ وَتُطَهِّرُنَا بِهَا مِنْ جَمِيعِ السَّيِّئَاتِ وَتَرْفَعُنَا بِهَا عِنْدَكَ أَعْلَى الدَّرَجَاتِ وَتُبَلِّغُنَا بِهَا أَقْصَى الْغَايَاتِ مِنْ جَمِيعِ الخَيْرَاتِ فِي الْحَيَاةِ وَبَعْدَ الْمَمَاتِ إِنَّكَ عَلَى ، كُلِّ شَيْءٍ قَدِيرٌ",
        "arabic_latin": "Allâhumma shalli alâ sayyidinâ Muhammadin shalâtan tunjîna bihâ min jamî'il ahwâli wal âfâti wa taqdhî lanâ bihâ jamî'al hâjâti wa tuthahhiranâ bihâ min jamî'is sayyi'âti wa tarfa'unâ bihâ 'indaka a'lad darajâti wa tuballighunâ bihâ aqshâl ghâyâti min jamî'il khairâti fil hayâti wa ba'dal mamâti innaka 'alâ kulli syai'in qadîrun.",
        "translation": "Ya Allah, curahkanlah rahmat kepada junjungan kami, Nabi Muhammad, dengan sholawat yang dapat menyelamatkan kami dari segala macam bencana dan penyakit, dapat memenuhi segala kebutuhan kami, dapat menyucikan kami dari segala kotoran, dapat mengangkat kami kepada tempat tertinggi di sisi-Mu, dan dapat menyampaikan kami pada tujuan- tujuan yang terjauh dari segala kebaikan di dunia dan setelah mati. Sesungguhnya Engkau Mahakuasa atas segala sesuatu."
      },
      {
        "name": "Sholawat Shâhibun-Nasab",
        "arabic": "اللهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ صَاحِبِ النَّسَبِ الشَّرِيفِ وَعَلَى أَلِهِ وَصَحْبِهِ وَسَلَّمْ",
        "arabic_latin": "Allâhumma shalli alâ Sayyidinâ Muhammadin shâhibin nasabisy-syarîfi wa 'alâ âlihi wa shahbihi wa sallim.",
        "translation": "Ya Allah curahkanlah rahmat dan keselamatan kepada junjungan kami, Nabi Muhammad, yang memiliki keturunan mulia, juga kepada keluarga dan sahabatnya."
      },
      {
        "name": "Sholawat Bani Hasyim",
        "arabic": "اللهُمَّ صَلِّ عَلَى النَّبِيِّ الْهَاشِمِي مُحَمَّدٍ وَعَلَى الِهِ وَسَلَّمْ تَسْلِيمًا",
        "arabic_latin": "Allâhumma shalli 'alân-nabiyil Hâsyimiyyi Muhammadin wa 'alâ âlihi wa sallim taslîmân.",
        "translation": "Ya Allah, berikanlah rahmat serta salam kepada seorang nabi keturunan Bangsawan Hasyim, yakni Muhammad beserta keluarganya, semoga tetap selamat dan sejahtera."
      },
      {
        "name": "Sholawat Qad Dhâqat",
        "arabic": "اَلصَّلَاةُ وَالسَّلَامُ عَلَيْكَ يَا سَيْدِى يَارَسُوْلَ اللهِ قَدْ ضَاقَتْ حِيْلَتِي أَدْرِكْنِي",
        "arabic_latin": "Ash-shalâtu wassalamu'alaika yâ Sayyidî yâ Rasûlullâh qad dhâqats hîlatî adriknî",
        "translation": "Rahmat dan keselamatan semoga tetap atas engkau wahai penghulu kami, ya Rasulullah, habis daya upayaku, semoga engkau berkenan menolongku."
      }
    ]
  }
  